---
kind: method
id: M:Autodesk.Revit.UI.DockablePane.Dispose
source: html/0b2603ee-5d51-fd12-0af9-ccfa907d2667.htm
---
# Autodesk.Revit.UI.DockablePane.Dispose Method

Releases all resources used by the DockablePane

## Syntax (C#)
```csharp
public void Dispose()
```